content/doc-notes/moon-1999-mathem-method.org
* Mathematical methods and algorithms for signal processing, Moon, T., & Stirling, W., , (1999) :book:

See [[cite:&moon-1999-mathem-method]]

* Chapter 3: Representation and approximation in vector spaces
** The approximation problem in Hilbert space
The analysis problem is this: given a vector $x \in S$, find the coefficients $c_1, c_2, ..., c_m$ that

\begin{equation*}
\hat{x} = c_1 p_1 + c_2 p_2 + \cdots + c_m p_m
\end{equation*}

Where the $\hat{\cdot}$ is used in indicate an approximation $x = \hat{x} + e$.

\begin{equation*}
||x - \hat{x}|| = ||e||
\end{equation*}

When using the $l_2$ or $L_2$ norm, this is called the least-squares problem. Because we know that the error is
minimized when the error is perpendicular to the data, we can leverage the inner-product (also the $l_2$ norm) to
minimize the problem by writing

\begin{equation*}
\Big< x - \sum_{i=1}^m c_i p_i, p_j \Big> \text{ for } 1,2,...,m
\end{equation*}

In matrix form this equates to

\begin{equation*}
\begin{bmatrix}
<p_1, p_1> & <p_2, p_1> & \cdots & <p_m, p_1> \\
<p_1, p_2> & <p_2, p_2> & \cdots & <p_m, p_2> \\
\vdots          &            &    & \vdots          \\
<p_1, p_m> & <p_2, p_m> & \cdots & <p_m, p_1> \\
\end{bmatrix}
\begin{bmatrix}
c_1 \\ c_2 \\ \vdots \\ c_m
\end{bmatrix}
=
\begin{bmatrix}
<x,p1> \\ <x,p2> \\ \vdots \\ <x,pm> \\
\end{bmatrix}
\end{equation*}

*** The Grammian Matrix
Let $R$ be called the Grammian matrix.

\begin{equation*}
R =
\begin{bmatrix}
<p_1, p_1> & <p_2, p_1> & \cdots & <p_m, p_1> \\
<p_1, p_2> & <p_2, p_2> & \cdots & <p_m, p_2> \\
\vdots          &            &    & \vdots          \\
<p_1, p_m> & <p_2, p_m> & \cdots & <p_m, p_1> \\
\end{bmatrix}
\end{equation*}

The Grammian is a Hermitian symmetric matrix; that is $R^H = R$ where $\cdot^H$ is the conjugate transpose. This also
implies that $R$ is invertible. This brings us to the following theorem

#+name theorem3.1
#+begin_quote
A Grammian matrix $R$ is always positive-semidefinite ($x^HRx \ge 0 \forall x \in \mathbb{C}^m$). It is positive definite $\iff$ the
vectors $p_1, p_2, ..., p_n$ are linearly independent.
#+end_quote

*It is of note that if the set of vectors $\{p\}$ are orthogonal, then the Grammian becomes a diagonal matrix.*

** The orthogonality principle
#+name theorem3.2
#+begin_quote
Let $p_1, p_2, ..., p_n$ be data vectors in a vector space $S$. Let $x$ be any vector in $S$. In this representation

\begin{equation*}
x = \sum_{i=1}^m c_i p_i + e = \hat{x} + e
\end{equation*}

the induced norm of the error vector $||e||$ is minimized when the error $e = x - \hat{x}$ is orthogonal to each of the
data vectors

\begin{equation*}
\Big< x - \sum_{i=1}^m c_i p_i, p_j \Big> \text{ for } 1,2,...,m
\end{equation*}

#+end_quote

*** Representations in infinite-dimensional space
The convergence of this infinite sum must be examined carefully. However, $T$ is an orthonormal set, then the
representation can be shown to converge.

** Error minimization via gradients
This section verifies the least squared solution using the gradient method used in optimization. Because we want to
minimize the error $e = x - \sum_{i=1}^m c_i p_i$, then we can write

\begin{equation*}
J(c) = \big<e,e\big> = \Big< x - \sum_{i=1}^m c_i p_i, x - \sum_{i=1}^m c_i p_i \Big> = ||x||^2 - 2\text{Re}(c^Hp) + c^H Rc
\end{equation*}

Note that =Re= in $\text{Re}(c^Hp)$ indicates the real part of the value $c^Hp$. Taking the gradient of the equation above
reduces to $Rc = p$, which is what we found before.

** Matrix representation of least-squares problem
For finite-dimensional vectors (signals), matrix notation may be employed. The approximation problem can then be written
as

#+begin_quote
Determine $c$ to minimize $||e||^2_2$ in the problem $x = Ac + e = \hat{x} + e$
#+end_quote

After some mathematical manipulation we find the important solution that for the equation $Rc = p$ the optimal
(least-squares) solution is

\begin{equation*}
c = (A^H A)^{-1} A^H x = R^{-1}p
\end{equation*}

Although we could use $R^{-1}$, the problem of numerical stability arises. The pseudo-inverse of $A$ ($(A^H A)^{-1}
A^H$), is more numerically stable. Furthermore, $P = (A^H A)^{-1} A^H$ is a projection matrix. Thus, we optimally
project $x$ orthogonally down into the range of $A$ and find the best solution in that range space.

*** Weighted least-squares
This is naturally incorporated into the inner product. As we have seen before $\big< x,y \big>_W = y^H W x$, from this
we can expand and solve similarly as before to achieve the following solution.

\begin{equation*}
c = (A^H W A)^{-1} A^H W x
\end{equation*}

