docs/doc-notes/moon-1999-mathem-method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-01 Sat 11:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org11f17ea">1. Mathematical methods and algorithms for signal processing, Moon, T., &amp; Stirling, W., , (1999)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a></li>
<li><a href="#org9893bcd">2. Chapter 3: Representation and approximation in vector spaces</a>
<ul>
<li><a href="#org239f916">2.1. The approximation problem in Hilbert space</a>
<ul>
<li><a href="#orgd3ebe94">2.1.1. The Grammian Matrix</a></li>
</ul>
</li>
<li><a href="#org81aeced">2.2. The orthogonality principle</a>
<ul>
<li><a href="#orgc0ac7eb">2.2.1. Representations in infinite-dimensional space</a></li>
</ul>
</li>
<li><a href="#org37b6127">2.3. Error minimization via gradients</a></li>
<li><a href="#org897fe99">2.4. Matrix representation of least-squares problem</a>
<ul>
<li><a href="#orgcd5499c">2.4.1. Weighted least-squares</a></li>
<li><a href="#org8ef95de">2.4.2. Statistical properties of the least-squares estimate</a></li>
</ul>
</li>
<li><a href="#orgdb64660">2.5. Minimum error in vector-space approximations</a></li>
<li><a href="#org3092066">2.6. Approximation by continuous polynomials</a></li>
<li><a href="#org311dd7a">2.7. Approximation by discrete polynomials</a></li>
<li><a href="#org7ca629c">2.8. Linear regression</a></li>
<li><a href="#org5b7ce69">2.9. Least-squares filtering</a>
<ul>
<li><a href="#orgd770b41">2.9.1. Least-squares prediction and AR spectrum estimation</a></li>
</ul>
</li>
<li><a href="#orgcc8301d">2.10. Minimum mean-squared estimation</a></li>
<li><a href="#orgee15423">2.11. Minimum mean-squared error (MMSE) filtering</a></li>
<li><a href="#org36dee58">2.12. Comparison of least-squared and minimum mean-squares</a></li>
<li><a href="#org8bf11ba">2.13. Frequency-domain optimal filtering</a>
<ul>
<li><a href="#org05c3d6b">2.13.1. Brief review of stochastic processes and Laplace transforms</a></li>
<li><a href="#org3b107ca">2.13.2. Filtering of stochatsic processes</a></li>
<li><a href="#org3a104a4">2.13.3. Lumped systems and processes</a></li>
</ul>
</li>
<li><a href="#org822cdf5">2.14. A dual approximation problem</a></li>
<li><a href="#orga878c83">2.15. Minimum-norm solution of undetermined equations</a></li>
<li><a href="#orgd89c107">2.16. Iterative reweighted LS (DRLS) for lp optimization</a></li>
<li><a href="#org3192871">2.17. Set of complete orthogonal functions</a>
<ul>
<li><a href="#org05be1eb">2.17.1. Theorem 3.5</a></li>
</ul>
</li>
<li><a href="#orgdbcb6ea">2.18. Signals as points; digital communications</a>
<ul>
<li><a href="#org52aa58d">2.18.1. Trigonometric functions</a></li>
<li><a href="#org05835a1">2.18.2. Orthogonal polynomials</a></li>
<li><a href="#org9dd3258">2.18.3. Families of orthogonal polynomials</a></li>
<li><a href="#orgb83d4f8">2.18.4. Legendre polynomials</a></li>
<li><a href="#org9e1f6d8">2.18.5. Chebyshev polynomials</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org11f17ea" class="outline-2">
<h2 id="org11f17ea"><span class="section-number-2">1.</span> Mathematical methods and algorithms for signal processing, Moon, T., &amp; Stirling, W., , (1999)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
See <a href="&amp;moon-1999-mathem-method">&amp;moon-1999-mathem-method</a>
</p>
</div>
</div>

<div id="outline-container-org9893bcd" class="outline-2">
<h2 id="org9893bcd"><span class="section-number-2">2.</span> Chapter 3: Representation and approximation in vector spaces</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org239f916" class="outline-3">
<h3 id="org239f916"><span class="section-number-3">2.1.</span> The approximation problem in Hilbert space</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The analysis problem is this: given a vector \(x \in S\), find the coefficients \(c_1, c_2, ..., c_m\) that
</p>

\begin{equation*}
\hat{x} = c_1 p_1 + c_2 p_2 + \cdots + c_m p_m
\end{equation*}

<p>
Where the \(\hat{\cdot}\) is used in indicate an approximation \(x = \hat{x} + e\).
</p>

\begin{equation*}
||x - \hat{x}|| = ||e||
\end{equation*}

<p>
When using the \(l_2\) or \(L_2\) norm, this is called the least-squares problem. Because we know that the error is
minimized when the error is perpendicular to the data, we can leverage the inner-product (also the \(l_2\) norm) to
minimize the problem by writing
</p>

\begin{equation*}
\Big< x - \sum_{i=1}^m c_i p_i, p_j \Big> \text{ for } 1,2,...,m
\end{equation*}

<p>
In matrix form this equates to
</p>

\begin{equation*}
\begin{bmatrix}
<p_1, p_1> & <p_2, p_1> & \cdots & <p_m, p_1> \\
<p_1, p_2> & <p_2, p_2> & \cdots & <p_m, p_2> \\
\vdots          &            &    & \vdots          \\
<p_1, p_m> & <p_2, p_m> & \cdots & <p_m, p_1> \\
\end{bmatrix}
\begin{bmatrix}
c_1 \\ c_2 \\ \vdots \\ c_m
\end{bmatrix}
=
\begin{bmatrix}
<x,p1> \\ <x,p2> \\ \vdots \\ <x,pm> \\
\end{bmatrix}
\end{equation*}
</div>

<div id="outline-container-orgd3ebe94" class="outline-4">
<h4 id="orgd3ebe94"><span class="section-number-4">2.1.1.</span> The Grammian Matrix</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Let \(R\) be called the Grammian matrix.
</p>

\begin{equation*}
R =
\begin{bmatrix}
<p_1, p_1> & <p_2, p_1> & \cdots & <p_m, p_1> \\
<p_1, p_2> & <p_2, p_2> & \cdots & <p_m, p_2> \\
\vdots          &            &    & \vdots          \\
<p_1, p_m> & <p_2, p_m> & \cdots & <p_m, p_1> \\
\end{bmatrix}
\end{equation*}

<p>
The Grammian is a Hermitian symmetric matrix; that is \(R^H = R\) where \(\cdot^H\) is the conjugate transpose. This also
implies that \(R\) is invertible. This brings us to the following theorem
</p>

<p>
#+name theorem3.1
</p>
<blockquote>
<p>
A Grammian matrix \(R\) is always positive-semidefinite (\(x^HRx \ge 0 \forall x \in \mathbb{C}^m\)). It is positive definite \(\iff\) the
vectors \(p_1, p_2, ..., p_n\) are linearly independent.
</p>
</blockquote>

<p>
<b>It is of note that if the set of vectors \(\{p\}\) are orthogonal, then the Grammian becomes a diagonal matrix.</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org81aeced" class="outline-3">
<h3 id="org81aeced"><span class="section-number-3">2.2.</span> The orthogonality principle</h3>
<div class="outline-text-3" id="text-2-2">
<p>
#+name theorem3.2
</p>
<blockquote>
<p>
Let \(p_1, p_2, ..., p_n\) be data vectors in a vector space \(S\). Let \(x\) be any vector in \(S\). In this representation
</p>

\begin{equation*}
x = \sum_{i=1}^m c_i p_i + e = \hat{x} + e
\end{equation*}

<p>
the induced norm of the error vector \(||e||\) is minimized when the error \(e = x - \hat{x}\) is orthogonal to each of the
data vectors
</p>

\begin{equation*}
\Big< x - \sum_{i=1}^m c_i p_i, p_j \Big> \text{ for } 1,2,...,m
\end{equation*}
</blockquote>
</div>

<div id="outline-container-orgc0ac7eb" class="outline-4">
<h4 id="orgc0ac7eb"><span class="section-number-4">2.2.1.</span> Representations in infinite-dimensional space</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The convergence of this infinite sum must be examined carefully. However, \(T\) is an orthonormal set, then the
representation can be shown to converge.
</p>
</div>
</div>
</div>

<div id="outline-container-org37b6127" class="outline-3">
<h3 id="org37b6127"><span class="section-number-3">2.3.</span> Error minimization via gradients</h3>
<div class="outline-text-3" id="text-2-3">
<p>
This section verifies the least squared solution using the gradient method used in optimization. Because we want to
minimize the error \(e = x - \sum_{i=1}^m c_i p_i\), then we can write
</p>

\begin{equation*}
J(c) = \big<e,e\big> = \Big< x - \sum_{i=1}^m c_i p_i, x - \sum_{i=1}^m c_i p_i \Big> = ||x||^2 - 2\text{Re}(c^Hp) + c^H Rc
\end{equation*}

<p>
Note that <code>Re</code> in \(\text{Re}(c^Hp)\) indicates the real part of the value \(c^Hp\). Taking the gradient of the equation above
reduces to \(Rc = p\), which is what we found before.
</p>
</div>
</div>

<div id="outline-container-org897fe99" class="outline-3">
<h3 id="org897fe99"><span class="section-number-3">2.4.</span> Matrix representation of least-squares problem</h3>
<div class="outline-text-3" id="text-2-4">
<p>
For finite-dimensional vectors (signals), matrix notation may be employed. The approximation problem can then be written
as
</p>

<blockquote>
<p>
Determine \(c\) to minimize \(||e||^2_2\) in the problem \(x = Ac + e = \hat{x} + e\)
</p>
</blockquote>

<p>
After some mathematical manipulation we find the important solution that for the equation \(Rc = p\) the optimal
(least-squares) solution is
</p>

\begin{equation*}
c = (A^H A)^{-1} A^H x = R^{-1}p
\end{equation*}

<p>
Although we could use \(R^{-1}\), the problem of numerical stability arises. The pseudo-inverse of \(A\) (\((A^H A)^{-1}
A^H\)), is more numerically stable. Furthermore, \(P = (A^H A)^{-1} A^H\) is a projection matrix. Thus, we optimally
project \(x\) orthogonally down into the range of \(A\) and find the best solution in that range space.
</p>
</div>

<div id="outline-container-orgcd5499c" class="outline-4">
<h4 id="orgcd5499c"><span class="section-number-4">2.4.1.</span> Weighted least-squares</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
This is naturally incorporated into the inner product. As we have seen before \(\big< x,y \big>_W = y^H W x\), from this
we can expand and solve similarly as before to achieve the following solution.
</p>

\begin{equation*}
c = (A^H W A)^{-1} A^H W x
\end{equation*}
</div>
</div>
