content/doc-notes/moon-1999-mathem-method.org
*** Statistical properties of the least-squares estimate
Suppose that we have a true model $x = Ac_0 + e$ that we wish to estimate. Using our solution of $c$ results in an
expected value of $c_0$. Such an estimate is said to be unbiased.

\begin{equation*}
E[c] = E[c_0 + (A^H A)^{-1} A^H e] = c_0
\end{equation*}

Furthermore, the estimator $c$ is said to be the best linear unbiased estimator. See the book for the proof.

** Minimum error in vector-space approximations
In this section we examine how much error is left when an optimal (minimal-norm) solution is obtained. Using the
Pythagorean theorem, the squared norm of the minimum error is

\begin{equation*}
||e_{min}||^2 = ||x||^2 - ||\hat{x}||^2
\end{equation*}

Using the matrix representation we can write

\begin{equation*}
||e_{min}||^2 = x^Hx - c^Hp
\end{equation*}

And using $\hat{x}  = Ac = A(A^H A)^{-1} A^H x$ we can write

\begin{equation*}
||e_{min}||^2 = x^H (I - A(A^HA)^{-1} A^H)x
\end{equation*}

** Approximation by continuous polynomials
Say we want to approximate a real continuous function $f(t)$ over an interval $t \in [a,b]$ to minimize the norm

\begin{equation*}
\int_a^b (f(t) - p(t))^2 dt
\end{equation*}

Where $p(t)$ has a degree of $m-1$. We take the basis vectors to be $\{1,t,t^2,...,t^{m-1}\}$. Using the inner product,
the principal of orthogonality, and appliying the inner product $\int_a^b f(t)g(t) dt$ we get the resulting Grammian
matrix

\begin{equation*}
R =
\begin{bmatrix}
1 & 1/2 & \cdots & 1/m\\
1/2 & 1/3 & \cdots & 1/(m+1)\\
\vdots          &            &    & \vdots          \\
1/m & 1/(m+1) & \cdots & 1/(2m)\\
\end{bmatrix}
\end{equation*}

A matrix of this form is known as a Hilbert matrix. It becomes ill conditioned very easily as $m$ increases. Although the
Hilbert matrix is ill conditioned, we can use a set of orthogonal polynomials that span the same set which will be well
conditioned.

If certain regions are of more interest, weighted norms can be taken

\begin{equation*}
\int_a^b w(t)(f(t) - p(t))^2 dt
\end{equation*}

which induces the inner product

\begin{equation*}
\int_a^b f(t)g(t) dt
\end{equation*}

** Approximation by discrete polynomials
This section is extremely analogous to the previos section but is of more practical value. We can approximate discrete
(sampled) data similarly by using a set of discrete-time basis functions $\{1,k,...,k^{m-1}\}$. *We desire to
fit an $(m-1)$st order polynomial through the data points $x_1, x_2, ..., x_n$ so that $x_k \approx p(k) \text{ for }
k=1,2,..., n$ where $p(k) = c_0 + c_1k + c_2 k^2 + ... + c_{m-1}k^{m-1}$*

If $m=n$ then there exists a polynomial that will pass through all $n$ points. If $m < n$, which is what we have an
interested in, then we want to reduce the squared error

\begin{equation*}
\sum_{k=1}^n |x_n - p(k)|^2 = || x - p ||_2^2
\end{equation*}

The first reprsentation is in summation form and the second is in vector form. This is induced from the inner product
$\big<x,y\big> = x^H y$. We are left with the equation $x = Pc + e$ This is interpreted as the data we wish to
approximate equals our approximation plus the error. This merely brings us back to our Grammian matrix, which we can use
the least-squares solution to produce

\begin{equation*}
c = (P^TP)^{-1}P^Tx
\end{equation*}

Where the transpose $\cdot^T$ can be replaced with the conjugate tranpose $\cdot^H$ if necessary. This we have our solution

\begin{equation*}
p = Pc = P(P^TP)^{-1}P^Tx
\end{equation*}

Example 3.7.1 is insightful if one is desired.

** Linear regression
Very similarly to before, but expanding on the concept a little. Suppose there is a set of points that we wish to fit a
line over. That is, we want a function $y_i \approx ax_i + b \text{ for } i = 1,2,...,n$. Letting $y$ be the vector of y
values, $e$ voctor of errors, $c = [a b]^T$, and

\begin{equation*}
A =
\begin{bmatrix}
x_1 & 1 \\
x_2 & 1 \\
\vdots & \vdots \\
x_n & 1
\end{bmatrix}
\end{equation*}

This gives rise to the equation

\begin{equation*}
y = Ac + e
\end{equation*}

Using the least-sqares solution, we get

\begin{equation*}
c = (A^HA)^{-1}Ay
\end{equation*}

