content/doc-notes/moon-1999-mathem-method.org
** Least-squares filtering
The goal of least-squares filtering problem is to filter a sequence of input data $\{f[t]\}$ suing a filter with impulse
response $h[t]$ of length $m$ to produce an output that matches a desired sequence $\{d[t]\}$ as closely as possible.

Let the output of the filter be denoted as

\begin{equation*}
y[t] = \sum_{i=0}^{m-1} h[i]f[t-i]
\end{equation*}

And let $d[t] = y[t] + e[t]$ as before. When doing least-squares filtering, the criterion of minimal error is that the
sum of the squared errors is as small as possible

\begin{equation*}
\text{min} \sum_{i_1}^i_2 |e[i]|^2
\end{equation*}

Where $i_1$ and $i_2$ are the starting and end points of the data indices we desire to minimize. And just as Bob is you
uncle, we get the expected solution

\begin{equation*}
h = (A^HA)^{-1}A^hd
\end{equation*}

The interesting bit here is that $A$ can be structured in a couple different ways to get different filtering techniques.

- The "covariance" method

  In this method, only the data that is explicitly given is used. There are no assumptions made about unknown data
  outside the observed data. The Grammian $A^HA$ produced by this is a Hermitian matrix.


\begin{equation*}
A =
\begin{bmatrix}
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
\end{bmatrix}
\end{equation*}

- The "autocorrelation" method

  In this case, the data prior to $f[1]$ and after $f[N]$ are assumed to all be zero and are padded in the matrix as
  such. The Grammian matrix produced by this is an Toeplitz matrix.

\begin{equation*}
A =
\begin{bmatrix}
f[1] &  0 & 0 & \cdots & 0 \\
f[2] &  f[1]  & 0 & \cdots & 0 \\
f[3] &  f[2] & f[1] & \cdots & 0 \\
\vdots     &      &       &    &     \\
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
0 &  f[N] & f[N-1] & \cdots & f[N-m+2] \\
0 &  0 & 0 & \cdots & f[N] \\
\end{bmatrix}
\end{equation*}

- Pre-windowing method

  This method assumes that $f[t] = 0$ for $t<1$, and use data up to $f[N], so that $i_1 = 1$ and $i_2 = N$.

\begin{equation*}
A =
\begin{bmatrix}
f[1] &  0 & 0 & \cdots & 0 \\
f[2] &  f[1]  & 0 & \cdots & 0 \\
f[3] &  f[2] & f[1] & \cdots & 0 \\
\vdots     &      &       &    &     \\
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
\end{bmatrix}
\end{equation*}

- Post-windowing method

  This method begins with $f[t] = m$ and assumes that data after $N$ are equal to zero.

\begin{equation*}
A =
\begin{bmatrix}
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
0    &  f[N] & f[N-1] & \cdots & f[N-m+2] \\
\vdots     &      &       &    &     \\
0    &  0   & 0     & \cdots & f[N] \\
\end{bmatrix}
\end{equation*}

Take a look at the examples 3.9.1 through 3.9.3.

*** Least-squares prediction and AR spectrum estimation
Consider the estimation problem where we desire to predict $x[t]$ using a linear predictor based on $x[t-1], x[t-2],
... x[t-m]$,
As before we have a forward predictor

\begin{equation*}
x[t] = -\sum_{i=1}^m a_i x[t-i] + f[t]
\end{equation*}

Where $a_i = -h_i$. We can obtain more data about the system by incorporating a backward predictor as well. Because both
predictors use the same coefficients, we can use both predictors together to improve our estimate of the coefficients.

** Minimum mean-squared estimation
Up until now we have not assumed the existence of probabilistic models. In this section we change our viewpoint by
introducing probability.

Let $P_1, P_2, ..., P_m$ be zero mean random variables. We desire to find the coefficients $\{c_i\}$ to estimate the
random variable $X$ using

\begin{equation*}
X  = c_1P_1 + c_2P_2 + \cdots + c_m P_m + e
\end{equation*}

In such a way that the norm of the squared error is minimized. We now employ the inner product $\big<X,Y\big> =
E[X\bar{Y}]$ to which we find a similar looking matrix

\begin{equation*}
\begin{bmatrix}
<P_1, \bar{P_1}> & <P_2, \bar{P_1}> & \cdots & <P_M, \bar{P_1}> \\
<P_1, \bar{P_2}> & <P_2, \bar{P_2}> & \cdots & <P_M, \bar{P_2}> \\
\vdots          &            &    & \vdots          \\
<P_1, \bar{P_M}> & <P_2, \bar{P_M}> & \cdots & <P_M}, \bar{P_1}> \\
\end{bmatrix}
\end{equation*}

We continue to hold the form of $Rc = p$, but now just need to find a way to solve this with the expected values inside.
The minimum mean-squared error is given by

\begin{equation*}
||e||_{min}^2 = \sigma_x^2 p^Hc
\end{equation*}

** Minimum mean-squared error (MMSE) filtering
A minimum mean-square (MMS) filter is called a Wiener filter. It is mathematically similar to a least-squares filter,
except that the expectation operator is used as the inner product. Similarly, we have data $\{f[t]\}$ and want to design
a filter in such a way that we get as close as possible to some desired sequence $d[t]$. Focusing on the FIR filter with
$m$ coefficients, the output filter can be written as

\begin{equation*}
y[t] f[t]^H h
\end{equation*}

Expressed in matrix form $Rh = p$, so the solution is $h = R^{-1}p$. Not much is said about how to actually get the $R$
matrix because Moon is an ass. The matrix $R$ is the Grammian and has a Toeplitz structure.

See example 3.11.1 for some actually juicy stuff.

** Comparison of least-squared and minimum mean-squares
For the method of least-squares the following observations are made

1. Only the sequence of data observed at the time of the estimate is used in forming the estimate.
2. Depending upon assumptions made about the data before and after the observation interval, the Grammian matrix may not
   be Toeplitz.
3. No statistical model is necessarily assumed.

For minimum mean-squares the following observations are made

1. A statistical model for the correlations and cross-correlations is necessary. This must be obtained either from
   explicit knowledge of the channel and signal (as was seen in example 3.11 .I), or on the basis of the multivariable
   distribution of the data (as was seen in example 3.10.1). In the absence of such knowledge, it is common to estimate
   the necessary autocorrelation and cross-correlation values.
2. Commonly, the coefficients of the MMS technique are computed using a separate set of data whose statistics are
   assumed to be the same as those of the real data set of interest. This set of data is used as a training set to find
   the autocorrelation functions and the filter coefficients.
3. We also note that the (true) Grammian matrix R used in prediction and optimal FIR filtering problems is always a
   Toeplitz matrix, and hence fast algorithms apply to finding the coefficients.

** Frequency-domain optimal filtering
This section we develop optimal filtering techniques for scalar signals in the frequency domain.

