docs/doc-notes/moon-1999-mathem-method.html

<div id="outline-container-org5b7ce69" class="outline-3">
<h3 id="org5b7ce69"><span class="section-number-3">2.9.</span> Least-squares filtering</h3>
<div class="outline-text-3" id="text-2-9">
<p>
The goal of least-squares filtering problem is to filter a sequence of input data \(\{f[t]\}\) suing a filter with impulse
response \(h[t]\) of length \(m\) to produce an output that matches a desired sequence \(\{d[t]\}\) as closely as possible.
</p>

<p>
Let the output of the filter be denoted as
</p>

\begin{equation*}
y[t] = \sum_{i=0}^{m-1} h[i]f[t-i]
\end{equation*}

<p>
And let \(d[t] = y[t] + e[t]\) as before. When doing least-squares filtering, the criterion of minimal error is that the
sum of the squared errors is as small as possible
</p>

\begin{equation*}
\text{min} \sum_{i_1}^i_2 |e[i]|^2
\end{equation*}

<p>
Where \(i_1\) and \(i_2\) are the starting and end points of the data indices we desire to minimize. And just as Bob is you
uncle, we get the expected solution
</p>

\begin{equation*}
h = (A^HA)^{-1}A^hd
\end{equation*}

<p>
The interesting bit here is that \(A\) can be structured in a couple different ways to get different filtering techniques.
</p>

<ul class="org-ul">
<li><p>
The "covariance" method
</p>

<p>
In this method, only the data that is explicitly given is used. There are no assumptions made about unknown data
outside the observed data. The Grammian \(A^HA\) produced by this is a Hermitian matrix.
</p></li>
</ul>


\begin{equation*}
A =
\begin{bmatrix}
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
\end{bmatrix}
\end{equation*}

<ul class="org-ul">
<li><p>
The "autocorrelation" method
</p>

<p>
In this case, the data prior to \(f[1]\) and after \(f[N]\) are assumed to all be zero and are padded in the matrix as
such. The Grammian matrix produced by this is an Toeplitz matrix.
</p></li>
</ul>

\begin{equation*}
A =
\begin{bmatrix}
f[1] &  0 & 0 & \cdots & 0 \\
f[2] &  f[1]  & 0 & \cdots & 0 \\
f[3] &  f[2] & f[1] & \cdots & 0 \\
\vdots     &      &       &    &     \\
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
0 &  f[N] & f[N-1] & \cdots & f[N-m+2] \\
0 &  0 & 0 & \cdots & f[N] \\
\end{bmatrix}
\end{equation*}

<ul class="org-ul">
<li><p>
Pre-windowing method
</p>

<p>
This method assumes that \(f[t] = 0\) for \(t<1\), and use data up to $f[N], so that \(i_1 = 1\) and \(i_2 = N\).
</p></li>
</ul>

\begin{equation*}
A =
\begin{bmatrix}
f[1] &  0 & 0 & \cdots & 0 \\
f[2] &  f[1]  & 0 & \cdots & 0 \\
f[3] &  f[2] & f[1] & \cdots & 0 \\
\vdots     &      &       &    &     \\
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
\end{bmatrix}
\end{equation*}

<ul class="org-ul">
<li><p>
Post-windowing method
</p>

<p>
This method begins with \(f[t] = m\) and assumes that data after \(N\) are equal to zero.
</p></li>
</ul>

\begin{equation*}
A =
\begin{bmatrix}
f[m] &  f[m-1] & f[m-2] & \cdots & f[1] \\
f[m+1] &  f[m] & f[m-1] & \cdots & f[2] \\
\vdots     &      &       &    &     \\
f[N] &  f[N-1] & f[N-2] & \cdots & f[N-m+1] \\
0    &  f[N] & f[N-1] & \cdots & f[N-m+2] \\
\vdots     &      &       &    &     \\
0    &  0   & 0     & \cdots & f[N] \\
\end{bmatrix}
\end{equation*}

<p>
Take a look at the examples 3.9.1 through 3.9.3.
</p>
</div>

<div id="outline-container-orgd770b41" class="outline-4">
<h4 id="orgd770b41"><span class="section-number-4">2.9.1.</span> Least-squares prediction and AR spectrum estimation</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
Consider the estimation problem where we desire to predict \(x[t]\) using a linear predictor based on \(x[t-1], x[t-2],
... x[t-m]\),
As before we have a forward predictor
</p>

\begin{equation*}
x[t] = -\sum_{i=1}^m a_i x[t-i] + f[t]
\end{equation*}

<p>
Where \(a_i = -h_i\). We can obtain more data about the system by incorporating a backward predictor as well. Because both
predictors use the same coefficients, we can use both predictors together to improve our estimate of the coefficients.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcc8301d" class="outline-3">
<h3 id="orgcc8301d"><span class="section-number-3">2.10.</span> Minimum mean-squared estimation</h3>
<div class="outline-text-3" id="text-2-10">
<p>
Up until now we have not assumed the existence of probabilistic models. In this section we change our viewpoint by
introducing probability.
</p>

<p>
Let \(P_1, P_2, ..., P_m\) be zero mean random variables. We desire to find the coefficients \(\{c_i\}\) to estimate the
random variable \(X\) using
</p>

\begin{equation*}
X  = c_1P_1 + c_2P_2 + \cdots + c_m P_m + e
\end{equation*}

<p>
In such a way that the norm of the squared error is minimized. We now employ the inner product \(\big<X,Y\big> =
E[X\bar{Y}]\) to which we find a similar looking matrix
</p>

\begin{equation*}
\begin{bmatrix}
<P_1, \bar{P_1}> & <P_2, \bar{P_1}> & \cdots & <P_M, \bar{P_1}> \\
<P_1, \bar{P_2}> & <P_2, \bar{P_2}> & \cdots & <P_M, \bar{P_2}> \\
\vdots          &            &    & \vdots          \\
<P_1, \bar{P_M}> & <P_2, \bar{P_M}> & \cdots & <P_M}, \bar{P_1}> \\
\end{bmatrix}
\end{equation*}

<p>
We continue to hold the form of \(Rc = p\), but now just need to find a way to solve this with the expected values inside.
The minimum mean-squared error is given by
</p>

\begin{equation*}
||e||_{min}^2 = \sigma_x^2 p^Hc
\end{equation*}
</div>
</div>

<div id="outline-container-orgee15423" class="outline-3">
<h3 id="orgee15423"><span class="section-number-3">2.11.</span> Minimum mean-squared error (MMSE) filtering</h3>
<div class="outline-text-3" id="text-2-11">
<p>
A minimum mean-square (MMS) filter is called a Wiener filter. It is mathematically similar to a least-squares filter,
except that the expectation operator is used as the inner product. Similarly, we have data \(\{f[t]\}\) and want to design
a filter in such a way that we get as close as possible to some desired sequence \(d[t]\). Focusing on the FIR filter with
\(m\) coefficients, the output filter can be written as
</p>

\begin{equation*}
y[t] f[t]^H h
\end{equation*}

<p>
Expressed in matrix form \(Rh = p\), so the solution is \(h = R^{-1}p\). Not much is said about how to actually get the \(R\)
matrix because Moon is an ass. The matrix \(R\) is the Grammian and has a Toeplitz structure.
</p>

<p>
See example 3.11.1 for some actually juicy stuff.
</p>
</div>
</div>

<div id="outline-container-org36dee58" class="outline-3">
<h3 id="org36dee58"><span class="section-number-3">2.12.</span> Comparison of least-squared and minimum mean-squares</h3>
<div class="outline-text-3" id="text-2-12">
<p>
For the method of least-squares the following observations are made
</p>

<ol class="org-ol">
<li>Only the sequence of data observed at the time of the estimate is used in forming the estimate.</li>
<li>Depending upon assumptions made about the data before and after the observation interval, the Grammian matrix may not
be Toeplitz.</li>
<li>No statistical model is necessarily assumed.</li>
</ol>

<p>
For minimum mean-squares the following observations are made
</p>

<ol class="org-ol">
<li>A statistical model for the correlations and cross-correlations is necessary. This must be obtained either from
explicit knowledge of the channel and signal (as was seen in example 3.11 .I), or on the basis of the multivariable
distribution of the data (as was seen in example 3.10.1). In the absence of such knowledge, it is common to estimate
the necessary autocorrelation and cross-correlation values.</li>
<li>Commonly, the coefficients of the MMS technique are computed using a separate set of data whose statistics are
assumed to be the same as those of the real data set of interest. This set of data is used as a training set to find
the autocorrelation functions and the filter coefficients.</li>
<li>We also note that the (true) Grammian matrix R used in prediction and optimal FIR filtering problems is always a
Toeplitz matrix, and hence fast algorithms apply to finding the coefficients.</li>
</ol>
</div>
</div>

<div id="outline-container-org8bf11ba" class="outline-3">
<h3 id="org8bf11ba"><span class="section-number-3">2.13.</span> Frequency-domain optimal filtering</h3>
<div class="outline-text-3" id="text-2-13">
<p>
This section we develop optimal filtering techniques for scalar signals in the frequency domain.
</p>
</div>
