content/doc-notes/moon-1999-mathem-method.org
*** Brief review of stochastic processes and Laplace transforms
The function $S_x(j\omega)$ is the usual power spectral density function. The autocovariance is real and even, that is

$$
S_x(s) = S_x(-s)
$$

Furthermore when $s=j\omega$

$$
S_x(-\omega) = S^*_x(\omega)
$$

*** Filtering of stochatsic processes
If the input $x$ and output $y$ are wide sense stationary stochastic processes the correlation functions are given by

\begin{equation*}
\begin{array}{l}
R_{xy}(\tau) = R_x(\tau) \ast h(-\tau) \\
R_{yx}(\tau) = h(\tau) \ast R_x(\tau)  \\
R_y(\tau)    = h(\tau) \ast R_x(\tau) \ast h(-\tau)
\end{array}
\end{equation*}

equivalently for the spectral domain

\begin{equation*}
\begin{array}{l}
S_{xy}(s) = S_x(s) H(s) \\
S_{yx}(s) = H(s) R_x(s)  \\
S_y(s)    = h(s) R_x(s) H(-s)
\end{array}
\end{equation*}

*** Lumped systems and processes
A linear system is said to be lumped if it has a rational transfer function; that is, its transfer function is a ratio of polynomials in $s$. Thus a rational transfer function is of the form below. Re also require that $n \ge m$

$$
G(s) = \frac{\Pi_{i=1}^m (s-z_i)}{\Pi_{i=1}^n (s-p_i)}
$$

A stochastic process is said to be lumped if its power spectral density is a rational function.

TODO: FINISH

** A dual approximation problem
Up until now we have selected a finite-dimensional subspace of the Hilbert space which involved solving an $m\times m$ system of equations. In some problems the subspace in which the solution lies is not finite dimensional. There are some problems where a finite set of constraints provides sufficient information to solve the problem from a finite set of equations.

#+begin_definition
Let $M$ be a subspace of a linear space $S$, and let $x_0 \in S$. The set $V = x_0 +M$ is said to be a translation of $M$ by $x_0$. This translation is called a linear variety. In general, a linear variety is not a subspace!
#+end_definition

Let $V = x_0 + M$ be a closed linear variety in a hilbert space. There exists a unique vector $v_0 \in V$ of minimum norm. Thie minimizing vector $v_0$ is orthogonal to $M$. Typically when we have seen problems like this the inner product $\big<x,y_i\big> = 0\; \forall i = 1,2,...,n$. The subspace defined by the set of inner products is $M^{\perp}$. Now that we have space that is offset we get non-zero results.

$$
\big<x,y_i\big> = a_i\; \forall i = 1,2,...,n
$$

Hence the space of solutions from the inner products above is the linear variety. A linear variety satisfying the $n$ constraints is said to be a codimension n, since the orthogonal compliment of the subpspace $M^\perp$ producing it has dimension $n$.

*See Example 3.14.2*

#+begin_theorem
Let ${y_i}$ be a linearly independent in a Hilbert space $S$, and let $M = \text{span}(y_1,...,y_m)$. The element $x \in S$ satisfying 

$$
\big<x,y_i\big> = a_i\; \forall i = 1,2,...,n
$$

with minimum norm lies in $M$; specifically

$$
x = \sum_{i=1}^m c_i y_i
$$

where the coefficients in this linear combination satisfy

$$
\begin{bmatrix}
<y_1,y_1> & <y_2,y_1> & \cdots & <y_m,y_1> \\
<y_1,y_2> & <y_2,y_2> & \cdots & <y_m,y_2> \\
\vdots    &           &        &           \\
<y_1,y_m> & <y_2,y_m> & \cdots & <y_m,y_m> \\
\end{bmatrix}
\begin{bmatrix}
c_1 \\ c_2 \\ \vdots \\ c_m
\end{bmatrix} = 
\begin{bmatrix}
a_1 \\ a_2 \\ \vdots \\ a_m
\end{bmatrix}
$$
#+end_theorem

** Minimum-norm solution of undetermined equations
The solution to the dual problem provides a method of finding a least-squares solution to an underdetermined set of equations *See Example 3.15.1*. Generally speaking, given the following 

\begin{equation*}
\begin{array}{cc}
\text{Minimize} & ||x|| \\
\text{subject to} & Ax = b \\
\end{array}
\end{equation*}

The solution to the problem is $x = A^H(AA^H)^{-1}b$.

** Iterative reweighted LS (DRLS) for lp optimization
TODO

** Set of complete orthogonal functions
Much of the transformaiton theory employed in signal processing is encompassed by representations in an appropriate linear vector space. The set of basis functions for the transformation is chosen so that the coefficients convey desired information about the signal. Different basis functions allow us to extract different information about the signal.

If the basis functions are orthonormal, then the minimum squared error of the series representation is

\begin{equation}
\sum_{i=1}^m |c_i|^2 = \sum_{i=1}^m \big< x, p_i \big>^2 \le ||x||^2
\end{equation}

Which is known as /Bessel's inequality/.

When $\{p_i\}$ is a complete basis set, then the sequence $\{c_1,c_2,...\}$ completely describes $x$.

#+begin_definition
An orthonormal set $\{p_i, i = 1,2,3,...\}$ in a Hilbert space $S$ is complete if

\begin{equation*}
x = \sum_{i=1}^{\infty} \big<x,p_i \big> p_i\; \forall x \in S
\end{equation*}
#+end_definition

When $\{p_i\}$ is a complete basis set, then the sequence $\{c_i\}$ completely describes x; there is a one-to-one relationship between $x$ and $\{c_i\}$. Furthermore, completness can be further described via the following theorem

