docs/doc-notes/moon-1999-mathem-method.html

<div id="outline-container-org05c3d6b" class="outline-4">
<h4 id="org05c3d6b"><span class="section-number-4">2.13.1.</span> Brief review of stochastic processes and Laplace transforms</h4>
<div class="outline-text-4" id="text-2-13-1">
<p>
The function \(S_x(j\omega)\) is the usual power spectral density function. The autocovariance is real and even, that is
</p>

<p>
\[
S_x(s) = S_x(-s)
\]
</p>

<p>
Furthermore when \(s=j\omega\)
</p>

<p>
\[
S_x(-\omega) = S^*_x(\omega)
\]
</p>
</div>
</div>

<div id="outline-container-org3b107ca" class="outline-4">
<h4 id="org3b107ca"><span class="section-number-4">2.13.2.</span> Filtering of stochatsic processes</h4>
<div class="outline-text-4" id="text-2-13-2">
<p>
If the input \(x\) and output \(y\) are wide sense stationary stochastic processes the correlation functions are given by
</p>

\begin{equation*}
\begin{array}{l}
R_{xy}(\tau) = R_x(\tau) \ast h(-\tau) \\
R_{yx}(\tau) = h(\tau) \ast R_x(\tau)  \\
R_y(\tau)    = h(\tau) \ast R_x(\tau) \ast h(-\tau)
\end{array}
\end{equation*}

<p>
equivalently for the spectral domain
</p>

\begin{equation*}
\begin{array}{l}
S_{xy}(s) = S_x(s) H(s) \\
S_{yx}(s) = H(s) R_x(s)  \\
S_y(s)    = h(s) R_x(s) H(-s)
\end{array}
\end{equation*}
</div>
</div>

<div id="outline-container-org3a104a4" class="outline-4">
<h4 id="org3a104a4"><span class="section-number-4">2.13.3.</span> Lumped systems and processes</h4>
<div class="outline-text-4" id="text-2-13-3">
<p>
A linear system is said to be lumped if it has a rational transfer function; that is, its transfer function is a ratio of polynomials in \(s\). Thus a rational transfer function is of the form below. Re also require that \(n \ge m\)
</p>

<p>
\[
G(s) = \frac{\Pi_{i=1}^m (s-z_i)}{\Pi_{i=1}^n (s-p_i)}
\]
</p>

<p>
A stochastic process is said to be lumped if its power spectral density is a rational function.
</p>

<p>
TODO: FINISH
</p>
</div>
</div>
</div>

<div id="outline-container-org822cdf5" class="outline-3">
<h3 id="org822cdf5"><span class="section-number-3">2.14.</span> A dual approximation problem</h3>
<div class="outline-text-3" id="text-2-14">
<p>
Up until now we have selected a finite-dimensional subspace of the Hilbert space which involved solving an \(m\times m\) system of equations. In some problems the subspace in which the solution lies is not finite dimensional. There are some problems where a finite set of constraints provides sufficient information to solve the problem from a finite set of equations.
</p>

<div class="definition" id="orgcab5519">
<p>
Let \(M\) be a subspace of a linear space \(S\), and let \(x_0 \in S\). The set \(V = x_0 +M\) is said to be a translation of \(M\) by \(x_0\). This translation is called a linear variety. In general, a linear variety is not a subspace!
</p>

</div>

<p>
Let \(V = x_0 + M\) be a closed linear variety in a hilbert space. There exists a unique vector \(v_0 \in V\) of minimum norm. Thie minimizing vector \(v_0\) is orthogonal to \(M\). Typically when we have seen problems like this the inner product \(\big<x,y_i\big> = 0\; \forall i = 1,2,...,n\). The subspace defined by the set of inner products is \(M^{\perp}\). Now that we have space that is offset we get non-zero results.
</p>

<p>
\[
\big<x,y_i\big> = a_i\; \forall i = 1,2,...,n
\]
</p>

<p>
Hence the space of solutions from the inner products above is the linear variety. A linear variety satisfying the \(n\) constraints is said to be a codimension n, since the orthogonal compliment of the subpspace \(M^\perp\) producing it has dimension \(n\).
</p>

<p>
<b>See Example 3.14.2</b>
</p>

<div class="theorem" id="org460c070">
<p>
Let \({y_i}\) be a linearly independent in a Hilbert space \(S\), and let \(M = \text{span}(y_1,...,y_m)\). The element \(x \in S\) satisfying 
</p>

<p>
\[
\big<x,y_i\big> = a_i\; \forall i = 1,2,...,n
\]
</p>

<p>
with minimum norm lies in \(M\); specifically
</p>

<p>
\[
x = \sum_{i=1}^m c_i y_i
\]
</p>

<p>
where the coefficients in this linear combination satisfy
</p>

<p>
$$
</p>
\begin{bmatrix}
<y_1,y_1> & <y_2,y_1> & \cdots & <y_m,y_1> \\
<y_1,y_2> & <y_2,y_2> & \cdots & <y_m,y_2> \\
\vdots    &           &        &           \\
<y_1,y_m> & <y_2,y_m> & \cdots & <y_m,y_m> \\
\end{bmatrix}
\begin{bmatrix}
c_1 \\ c_2 \\ \vdots \\ c_m
\end{bmatrix} = 
\begin{bmatrix}
a_1 \\ a_2 \\ \vdots \\ a_m
\end{bmatrix}
<p>
$$
</p>

</div>
</div>
</div>

<div id="outline-container-orga878c83" class="outline-3">
<h3 id="orga878c83"><span class="section-number-3">2.15.</span> Minimum-norm solution of undetermined equations</h3>
<div class="outline-text-3" id="text-2-15">
<p>
The solution to the dual problem provides a method of finding a least-squares solution to an underdetermined set of equations <b>See Example 3.15.1</b>. Generally speaking, given the following 
</p>

\begin{equation*}
\begin{array}{cc}
\text{Minimize} & ||x|| \\
\text{subject to} & Ax = b \\
\end{array}
\end{equation*}

<p>
The solution to the problem is \(x = A^H(AA^H)^{-1}b\).
</p>
</div>
</div>

<div id="outline-container-orgd89c107" class="outline-3">
<h3 id="orgd89c107"><span class="section-number-3">2.16.</span> Iterative reweighted LS (DRLS) for lp optimization</h3>
<div class="outline-text-3" id="text-2-16">
<p>
TODO
</p>
</div>
</div>

<div id="outline-container-org3192871" class="outline-3">
<h3 id="org3192871"><span class="section-number-3">2.17.</span> Set of complete orthogonal functions</h3>
<div class="outline-text-3" id="text-2-17">
<p>
Much of the transformaiton theory employed in signal processing is encompassed by representations in an appropriate linear vector space. The set of basis functions for the transformation is chosen so that the coefficients convey desired information about the signal. Different basis functions allow us to extract different information about the signal.
</p>

<p>
If the basis functions are orthonormal, then the minimum squared error of the series representation is
</p>

\begin{equation}
\sum_{i=1}^m |c_i|^2 = \sum_{i=1}^m \big< x, p_i \big>^2 \le ||x||^2
\end{equation}

<p>
Which is known as <i>Bessel's inequality</i>.
</p>

<p>
When \(\{p_i\}\) is a complete basis set, then the sequence \(\{c_1,c_2,...\}\) completely describes \(x\).
</p>

<div class="definition" id="org5c30bba">
<p>
An orthonormal set \(\{p_i, i = 1,2,3,...\}\) in a Hilbert space \(S\) is complete if
</p>

\begin{equation*}
x = \sum_{i=1}^{\infty} \big<x,p_i \big> p_i\; \forall x \in S
\end{equation*}

</div>

<p>
When \(\{p_i\}\) is a complete basis set, then the sequence \(\{c_i\}\) completely describes x; there is a one-to-one relationship between \(x\) and \(\{c_i\}\). Furthermore, completness can be further described via the following theorem
</p>
</div>
