docs/doc-notes/moon-1999-mathem-method.html

<div id="outline-container-org05be1eb" class="outline-4">
<h4 id="org05be1eb"><span class="section-number-4">2.17.1.</span> Theorem 3.5</h4>
<div class="outline-text-4" id="text-2-17-1">
<p>
A set of orthornormal functions \(\{p_i, i=1,2,...\}\) is complete in an inner product space \(S\) with induced norm if any of the following equivalent statements holds:
</p>

<ol class="org-ol">
<li>\(x = \sum_{i=1}^{\infty} \big<x,p_i \big> p_i\; \forall x \in S\)</li>
<li>For any \(\epsilon > 0\) there is an \(N < \infty\) such that for all \(n \ge N\), \(||x = \sum_{i=1}^{\infty} \big<x,p_i \big> p_i|| < \epsilon\). In other words, we can appoximate aprbitrarily close.</li>
<li>Parseval's equality holds: \(||x||^2 = \sum_{x=1}^{\infty} \big< x, p_i \big>^2 \forall x \in S\)</li>
<li>If \(\big< x, p_i \big> \forall i\) then \(x = 0\)</li>
<li>There is no nonzero function \(f \in S\) for which the set \(\{p_i, i=1,2,...\} \cup f\) forms an orthogonal set.</li>
</ol>

<p>
<b>For a finite-dimensional space \(S\) of dimension \(m\), to have \(m\) linearly independent functions \(p_k, k=1,2,...,m\) is sufficient for completeness</b>.
</p>

<p>
We can define different transformations depending upon the set of orthonormal basis functions we choose. Since each coefficient In the transform is a projection of \(x\) onto the basis function, the transform coefficient \(c_i\), determines how much of \(p_i\), is in \(x\). If we want to look for particular features of a signal. one way is to design a set of orthogonal basis functions that have those features and compute a transform using those signals. 
</p>

<p>
If \(p_i\) is a complete set then there is no error in the representation and Bessel's inequality becomes an equality known as Parseval's equality.
</p>

\begin{equation}
||x||^2 = \sum_{x=1}^{\infty} |c_i|^2
\end{equation}

<p>
Equivalently written as \(||x|| = ||c||\) where the norm on the left is the \(L2\) norm (if \(x\) is a function) and the norm on the right is the \(l2\) norm.
</p>

<div class="lemma" id="org5bef9a3">
<p>
If \(x\) and \(y\) have a generalized Fourier series representation using some orthornarmal basis set \(\{p_i\}\) in a Hilbert space \(S\), with \(x \leftrightarrow c\) and \(y \leftrightarrow b\) then
</p>

\begin{equation*}
\big< x,y \big> = \big< c,b \big>
\end{equation*}

</div>
</div>
</div>
</div>

<div id="outline-container-orgdbcb6ea" class="outline-3">
<h3 id="orgdbcb6ea"><span class="section-number-3">2.18.</span> Signals as points; digital communications</h3>
<div class="outline-text-3" id="text-2-18">
<p>
There are several sets of complete orthogonal functions that are used in common applications. We will examine a few of the more commonly-used sets.
</p>
</div>

<div id="outline-container-org52aa58d" class="outline-4">
<h4 id="org52aa58d"><span class="section-number-4">2.18.1.</span> Trigonometric functions</h4>
<div class="outline-text-4" id="text-2-18-1">
<p>
The "familar" trigonometric functions employed in Fourier series are orthogonal. They form a complete set of functions.
</p>

\begin{equation*}
p_n(t) = \frac{e^{jnt}}{\sqrt{2\pi}}
\end{equation*}
</div>
</div>

<div id="outline-container-org05835a1" class="outline-4">
<h4 id="org05835a1"><span class="section-number-4">2.18.2.</span> Orthogonal polynomials</h4>
<div class="outline-text-4" id="text-2-18-2">
<p>
Different sets of orthogonal polynomials are obtained by using different weighting functions, and the inner product is taken over some given interval. Some orthogonal polynomials have shown up enough that we have given them a name. Given two polynomials \(f(t)\) and \(g(t)\), then they are said to be orthogonal with respect to a weighting function \(w(t)\) if
</p>

\begin{equation*}
\big< f,g \big>_w = 0
\end{equation*}

<p>
where 
</p>

\begin{equation*}
\big< f,g \big>_w = \int_a^b w(t)f(t)g(t) dt
\end{equation*}

<p>
Using the Gram-Schmidt procedure it is possible to orthogonalize any set of polynornials with respect to any inner product. In particular the set \(1,t,t^2,...,t^n\) can be orthogonalized with respect to the weighted inner product. *It can be shown that the orthogonal polynomials (properly normalized) form a complete orthonormal basis for \(L_ [a,b]\).
</p>
</div>
</div>

<div id="outline-container-org9dd3258" class="outline-4">
<h4 id="org9dd3258"><span class="section-number-4">2.18.3.</span> Families of orthogonal polynomials</h4>
<div class="outline-text-4" id="text-2-18-3">
<p>
A variety of types of orthogonal polynomials have been explored over the years. One of the general motivations for this is that orthogonal polynomials can be used to provide solutions to particular differential equations. Since these orthogonal polynomials form a complete orthogonal basis, they can be used to form series solutions for any boundary conditions and input function.
</p>
</div>
</div>

<div id="outline-container-orgb83d4f8" class="outline-4">
<h4 id="orgb83d4f8"><span class="section-number-4">2.18.4.</span> Legendre polynomials</h4>
<div class="outline-text-4" id="text-2-18-4">
<p>
These are not used too often, but show up from time to time. Using a weighting function of \(w(t) = 1\), the first three polynomials are
</p>

\begin{equation*}
\begin{array}{l}
p_0(t) = 1 \\
p_1(t) = t \\
p_2(t) = t^2 - 1/3 \\
p_3(t) = t^3 - 3/5t \\
\end{array}
\end{equation*}

<p>
Using Lemma 3.2 (not written in these notes), the general polynomial is 
</p>

\begin{equation*}
tp_n(t) = \frac{n+1}{2n+1}p_{n+1} + \frac{n}{2n+1}p_{n-1}(t)
\end{equation*}
</div>
</div>

<div id="outline-container-org9e1f6d8" class="outline-4">
<h4 id="org9e1f6d8"><span class="section-number-4">2.18.5.</span> Chebyshev polynomials</h4>
<div class="outline-text-4" id="text-2-18-5">
<p>
These polynomials are orthogonal with respect to the weighting function \(w(t) = \frac{1}{\sqrt{1-t^2}}\) over the interval \([-1,1]\). In particular
</p>

\begin{equation*}
\int_a^b = \frac{1}{\sqrt{1-t^2}}T_r(t)T_s(t) dt = 
\begin{cases}
0 & r \ne s \\
\pi & r = s = 0 \\
\frac{\pi}{2} & r = s /ne 0
\end{cases}
\end{equation*}

<p>
TODO
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-01 Sat 11:11</p>
</div>
</body>
</html>
